# Data Cleaning & Data Manipulation

In [1]:
import pandas as pd
import numpy as np

C:\Users\asus\AppData\Roaming\Python\Python311\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [2]:
data1=np.random.randn(10,3)
data2=np.random.randn(7,3)

In [3]:
df1=pd.DataFrame(data1,columns=["col1","col2","col3"])
df2=pd.DataFrame(data2,columns=["col1","col2","col3"])

In [4]:
df1

       col1      col2      col3
0  1.178024  0.720071 -0.119156
1  0.162918  0.238821  0.467635
2 -0.434306 -0.139605 -2.266606
3 -0.263432 -0.642803 -0.633524
4 -0.588941 -1.071097  0.631441
5 -0.254814 -0.214521 -0.330639
6  0.197054  0.257075 -1.134217
7 -0.300639 -1.513100  0.857433
8  1.038038  0.012564 -1.547923
9  0.370287  1.654530 -0.039817

In [5]:
df2

       col1      col2      col3
0  2.243792 -0.619967 -1.577685
1 -1.552405 -0.021783 -0.572902
2 -0.539359 -0.522334  0.707044
3 -0.267435 -0.552387  1.302541
4 -1.731632 -0.801519  0.444350
5  0.022742  0.188637  0.138573
6 -0.983874 -0.810958 -1.420895

In [6]:
df3=df1+df2

In [8]:
df3

       col1      col2      col3
0  0.404871 -1.470707 -0.799125
1  2.874353  1.551624 -0.100209
2 -2.952283  1.812115 -1.104965
3  0.112058 -0.124170  0.643325
4  2.526588  1.069561 -1.726816
5  0.532924  0.536779  2.444896
6  1.165092  1.374598  0.349444
7       NaN       NaN       NaN
8       NaN       NaN       NaN
9       NaN       NaN       NaN

In [7]:
df3=pd.concat([df1,df2],ignore_index=True)

In [8]:
df3

        col1      col2      col3
0   1.178024  0.720071 -0.119156
1   0.162918  0.238821  0.467635
2  -0.434306 -0.139605 -2.266606
3  -0.263432 -0.642803 -0.633524
4  -0.588941 -1.071097  0.631441
5  -0.254814 -0.214521 -0.330639
6   0.197054  0.257075 -1.134217
7  -0.300639 -1.513100  0.857433
8   1.038038  0.012564 -1.547923
9   0.370287  1.654530 -0.039817
10  2.243792 -0.619967 -1.577685
11 -1.552405 -0.021783 -0.572902
12 -0.539359 -0.522334  0.707044
13 -0.267435 -0.552387  1.302541
14 -1.731632 -0.801519  0.444350
15  0.022742  0.188637  0.138573
16 -0.983874 -0.810958 -1.420895

In [13]:
for i in df3["col3"]:
    print(i,end=" ")

-0.841925872632903 -0.7027905376490947 -0.4842088082334042 0.15277384712705694 -1.90607163477897 1.6403381333190346 -1.3420123003369622 -0.7649549068539782 -0.6865168775208013 1.612035706325372 0.042801334339809934 0.6025819031441192 -0.6207562659694963 0.49055099457725254 0.179255596086845 0.8045573857305175 1.691456788266963

iteritems

In [14]:
for key,value in df3.iteritems():
    print(key,value)

AttributeError: 'DataFrame' object has no attribute 'iteritems'

In [15]:
for key,value in df3.items():
    print(key,value)

col1 0     0.985276
1     2.768836
2    -1.325476
3     0.495646
4     1.190203
5     1.016242
6     1.226575
7     0.053667
8     0.849761
9     0.131513
10   -0.580405
11    0.105517
12   -1.626807
13   -0.383588
14    1.336385
15   -0.483318
16   -0.061484
Name: col1, dtype: float64
col2 0    -1.872780
1     0.313324
2     0.323965
3     0.201923
4    -0.270259
5     1.134484
6     1.847576
7     0.262423
8     0.390127
9     0.264615
10    0.402074
11    1.238300
12    1.488151
13   -0.326093
14    1.339820
15   -0.597705
16   -0.472978
Name: col2, dtype: float64
col3 0    -0.841926
1    -0.702791
2    -0.484209
3     0.152774
4    -1.906072
5     1.640338
6    -1.342012
7    -0.764955
8    -0.686517
9     1.612036
10    0.042801
11    0.602582
12   -0.620756
13    0.490551
14    0.179256
15    0.804557
16    1.691457
Name: col3, dtype: float64

In [16]:
for index,row in df3.iterrows():
    print(index,row)

0 col1    0.985276
col2   -1.872780
col3   -0.841926
Name: 0, dtype: float64
1 col1    2.768836
col2    0.313324
col3   -0.702791
Name: 1, dtype: float64
2 col1   -1.325476
col2    0.323965
col3   -0.484209
Name: 2, dtype: float64
3 col1    0.495646
col2    0.201923
col3    0.152774
Name: 3, dtype: float64
4 col1    1.190203
col2   -0.270259
col3   -1.906072
Name: 4, dtype: float64
5 col1    1.016242
col2    1.134484
col3    1.640338
Name: 5, dtype: float64
6 col1    1.226575
col2    1.847576
col3   -1.342012
Name: 6, dtype: float64
7 col1    0.053667
col2    0.262423
col3   -0.764955
Name: 7, dtype: float64
8 col1    0.849761
col2    0.390127
col3   -0.686517
Name: 8, dtype: float64
9 col1    0.131513
col2    0.264615
col3    1.612036
Name: 9, dtype: float64
10 col1   -0.580405
col2    0.402074
col3    0.042801
Name: 10, dtype: float64
11 col1    0.105517
col2    1.238300
col3    0.602582
Name: 11, dtype: float64
12 col1   -1.626807
col2    1.488151
col3   -0.620756
Name: 12, dtype: float64
13 col1   -0.383588
col2   -0.326093
col3    0.490551
Name: 13, dtype: float64
14 col1    1.336385
col2    1.339820
col3    0.179256
Name: 14, dtype: float64
15 col1   -0.483318
col2   -0.597705
col3    0.804557
Name: 15, dtype: float64
16 col1   -0.061484
col2   -0.472978
col3    1.691457
Name: 16, dtype: float64

sort

In [21]:
unsorted_df=pd.DataFrame(np.random.randn(10,3),
            index=[5,7,3,9,2,1,9,11,21,4],
            columns=["col1","col2","col3"])

In [22]:
unsorted_df

        col1      col2      col3
5   1.716560  1.187250  0.483918
7  -0.101954 -0.764775 -1.182716
3   0.706297  0.968973 -0.587928
9  -1.297704 -2.137300  1.321179
2  -0.737771  2.562361  0.711799
1   0.228102 -1.218720 -0.107385
9  -0.004448  1.807649  0.175905
11  0.795199  1.349697  0.913056
21  1.095342  0.135693  1.855872
4  -0.767827  0.906365 -0.784329

In [23]:
unsorted_df.sort_index()

        col1      col2      col3
1   0.228102 -1.218720 -0.107385
2  -0.737771  2.562361  0.711799
3   0.706297  0.968973 -0.587928
4  -0.767827  0.906365 -0.784329
5   1.716560  1.187250  0.483918
7  -0.101954 -0.764775 -1.182716
9  -1.297704 -2.137300  1.321179
9  -0.004448  1.807649  0.175905
11  0.795199  1.349697  0.913056
21  1.095342  0.135693  1.855872

In [24]:
unsorted_df.sort_index(ascending=False)

        col1      col2      col3
21  1.095342  0.135693  1.855872
11  0.795199  1.349697  0.913056
9  -1.297704 -2.137300  1.321179
9  -0.004448  1.807649  0.175905
7  -0.101954 -0.764775 -1.182716
5   1.716560  1.187250  0.483918
4  -0.767827  0.906365 -0.784329
3   0.706297  0.968973 -0.587928
2  -0.737771  2.562361  0.711799
1   0.228102 -1.218720 -0.107385

In [25]:
unsorted_df.sort_index(axis=1)

        col1      col2      col3
5   1.716560  1.187250  0.483918
7  -0.101954 -0.764775 -1.182716
3   0.706297  0.968973 -0.587928
9  -1.297704 -2.137300  1.321179
2  -0.737771  2.562361  0.711799
1   0.228102 -1.218720 -0.107385
9  -0.004448  1.807649  0.175905
11  0.795199  1.349697  0.913056
21  1.095342  0.135693  1.855872
4  -0.767827  0.906365 -0.784329

In [26]:
unsorted_df.sort_index(axis=1,ascending=False)

        col3      col2      col1
5   0.483918  1.187250  1.716560
7  -1.182716 -0.764775 -0.101954
3  -0.587928  0.968973  0.706297
9   1.321179 -2.137300 -1.297704
2   0.711799  2.562361 -0.737771
1  -0.107385 -1.218720  0.228102
9   0.175905  1.807649 -0.004448
11  0.913056  1.349697  0.795199
21  1.855872  0.135693  1.095342
4  -0.784329  0.906365 -0.767827

sort_values()

In [9]:
df=pd.DataFrame({"Apples":[50,95,106,75],"Grapes":[90,23,10,56]})

In [10]:
df

   Apples  Grapes
0      50      90
1      95      23
2     106      10
3      75      56

In [11]:
df.sort_values(by='Apples')

   Apples  Grapes
0      50      90
3      75      56
1      95      23
2     106      10

In [12]:
df.sort_values(by=['Apples','Grapes'])   #sort Apples columns first acorrding to this sort the Grapes columns

   Apples  Grapes
0      50      90
3      75      56
1      95      23
2     106      10

In [13]:
df.sort_values(by=['Apples','Grapes'],kind='mergesort') 
#optional
#1.quick sort
#2.mergesort
#3.heapsort

   Apples  Grapes
0      50      90
3      75      56
1      95      23
2     106      10

# statistical operation

In [14]:
df3.head(7)

       col1      col2      col3
0  1.178024  0.720071 -0.119156
1  0.162918  0.238821  0.467635
2 -0.434306 -0.139605 -2.266606
3 -0.263432 -0.642803 -0.633524
4 -0.588941 -1.071097  0.631441
5 -0.254814 -0.214521 -0.330639
6  0.197054  0.257075 -1.134217

In [15]:
df4=df3.drop([8,9,10,11,12,13,14,15,16])

In [45]:
df4

       col1      col2      col3
0  0.985276 -1.872780 -0.841926
1  2.768836  0.313324 -0.702791
2 -1.325476  0.323965 -0.484209
3  0.495646  0.201923  0.152774
4  1.190203 -0.270259 -1.906072
5  1.016242  1.134484  1.640338
6  1.226575  1.847576 -1.342012
7  0.053667  0.262423 -0.764955

Coveriance->cov()

In [46]:
df4.col2

0   -1.872780
1    0.313324
2    0.323965
3    0.201923
4   -0.270259
5    1.134484
6    1.847576
7    0.262423
Name: col2, dtype: float64

In [47]:
df4['col2']

0   -1.872780
1    0.313324
2    0.323965
3    0.201923
4   -0.270259
5    1.134484
6    1.847576
7    0.262423
Name: col2, dtype: float64

In [48]:
df4['col2'].cov(df4['col3'])

0.27958246410299775

In [50]:
df4.col2.cov(df4['col3'])  # two particular columns

0.27958246410299775

In [51]:
df4.cov   # entire dataset

<bound method DataFrame.cov of        col1      col2      col3
0  0.985276 -1.872780 -0.841926
1  2.768836  0.313324 -0.702791
2 -1.325476  0.323965 -0.484209
3  0.495646  0.201923  0.152774
4  1.190203 -0.270259 -1.906072
5  1.016242  1.134484  1.640338
6  1.226575  1.847576 -1.342012
7  0.053667  0.262423 -0.764955>

correlation

In [52]:
df4['col2'].corr(df4['col3'])  # two particular columns

0.2440930706756288

In [53]:
df4.corr  # entire dataset

<bound method DataFrame.corr of        col1      col2      col3
0  0.985276 -1.872780 -0.841926
1  2.768836  0.313324 -0.702791
2 -1.325476  0.323965 -0.484209
3  0.495646  0.201923  0.152774
4  1.190203 -0.270259 -1.906072
5  1.016242  1.134484  1.640338
6  1.226575  1.847576 -1.342012
7  0.053667  0.262423 -0.764955>

## Data Cleaning

In [16]:
df=pd.DataFrame(np.random.rand(5,3),
               index=['A',"C","E","B","D"],
               columns=["col1","col2","col3"])

In [17]:
df

       col1      col2      col3
A  0.329959  0.649713  0.755743
C  0.655309  0.817091  0.657176
E  0.825311  0.193598  0.450150
B  0.648103  0.615822  0.569647
D  0.019509  0.044092  0.569642

reindex

In [67]:
#df=df.reindex(['A','B','C',"D",'E'])

In [57]:
df

       col1      col2      col3
A  0.646493  0.616812  0.480287
B  0.726899  0.825767  0.624507
C  0.314875  0.523962  0.551742
D  0.446234  0.632813  0.051886
E  0.913637  0.954059  0.055815

In [20]:
df=df.reindex(['A','C','E','F','G'])

In [21]:
df

       col1      col2      col3
A  0.329959  0.649713  0.755743
C  0.655309  0.817091  0.657176
E  0.825311  0.193598  0.450150
F       NaN       NaN       NaN
G       NaN       NaN       NaN

In [22]:
df=df.reindex(['A','I','C',"G",'E','D','F','E',"H"])

In [23]:
df

       col1      col2      col3
A  0.329959  0.649713  0.755743
I       NaN       NaN       NaN
C  0.655309  0.817091  0.657176
G       NaN       NaN       NaN
E  0.825311  0.193598  0.450150
D       NaN       NaN       NaN
F       NaN       NaN       NaN
E  0.825311  0.193598  0.450150
H       NaN       NaN       NaN

In [24]:
df.isnull()

    col1   col2   col3
A  False  False  False
I   True   True   True
C  False  False  False
G   True   True   True
E  False  False  False
D   True   True   True
F   True   True   True
E  False  False  False
H   True   True   True

In [25]:
df.isna()

    col1   col2   col3
A  False  False  False
I   True   True   True
C  False  False  False
G   True   True   True
E  False  False  False
D   True   True   True
F   True   True   True
E  False  False  False
H   True   True   True

In [26]:
df.notnull()

    col1   col2   col3
A   True   True   True
I  False  False  False
C   True   True   True
G  False  False  False
E   True   True   True
D  False  False  False
F  False  False  False
E   True   True   True
H  False  False  False

In [27]:
df.isnull().sum()

col1    5
col2    5
col3    5
dtype: int64

In [28]:
df.notnull().sum()

col1    4
col2    4
col3    4
dtype: int64

In [29]:
df

       col1      col2      col3
A  0.329959  0.649713  0.755743
I       NaN       NaN       NaN
C  0.655309  0.817091  0.657176
G       NaN       NaN       NaN
E  0.825311  0.193598  0.450150
D       NaN       NaN       NaN
F       NaN       NaN       NaN
E  0.825311  0.193598  0.450150
H       NaN       NaN       NaN

In [30]:
df.isnull().sum(1)

A    0
I    3
C    0
G    3
E    0
D    3
F    3
E    0
H    3
dtype: int64

In [31]:
df.isnull().sum().sum()

15

In [32]:
df.count()

col1    4
col2    4
col3    4
dtype: int64

In [33]:
df['col1'].isnull()

A    False
I     True
C    False
G     True
E    False
D     True
F     True
E    False
H     True
Name: col1, dtype: bool

In [84]:
df.loc['G'].isnull()

col1    True
col2    True
col3    True
Name: G, dtype: bool

How to cleaning missing(NaN) value

In [85]:
df.fillna(0)

       col1      col2      col3
A  0.310277  0.582183  0.565652
I  0.000000  0.000000  0.000000
C  0.097842  0.955256  0.189705
G  0.000000  0.000000  0.000000
E  0.273432  0.906906  0.791157
D  0.260272  0.298359  0.759697
F  0.000000  0.000000  0.000000
E  0.273432  0.906906  0.791157
H  0.000000  0.000000  0.000000

In [89]:
df.fillna("Filling")  #don't use this because it fill same data 
# i want some relevent data in dataframe that associate with another value

       col1      col2      col3
A  0.310277  0.582183  0.565652
I   Filling   Filling   Filling
C  0.097842  0.955256  0.189705
G   Filling   Filling   Filling
E  0.273432  0.906906  0.791157
D  0.260272  0.298359  0.759697
F   Filling   Filling   Filling
E  0.273432  0.906906  0.791157
H   Filling   Filling   Filling

In [34]:
#Forward method -pad/ffill
#backward method -bfill/backfill

df.fillna(method='pad')

C:\Users\asus\AppData\Local\Temp\ipykernel_16732\861703502.py:4: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='pad')

       col1      col2      col3
A  0.329959  0.649713  0.755743
I  0.329959  0.649713  0.755743
C  0.655309  0.817091  0.657176
G  0.655309  0.817091  0.657176
E  0.825311  0.193598  0.450150
D  0.825311  0.193598  0.450150
F  0.825311  0.193598  0.450150
E  0.825311  0.193598  0.450150
H  0.825311  0.193598  0.450150

In [35]:
df.fillna(method='ffill')

C:\Users\asus\AppData\Local\Temp\ipykernel_16732\1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

       col1      col2      col3
A  0.329959  0.649713  0.755743
I  0.329959  0.649713  0.755743
C  0.655309  0.817091  0.657176
G  0.655309  0.817091  0.657176
E  0.825311  0.193598  0.450150
D  0.825311  0.193598  0.450150
F  0.825311  0.193598  0.450150
E  0.825311  0.193598  0.450150
H  0.825311  0.193598  0.450150

In [36]:
df.fillna(method='bfill')

C:\Users\asus\AppData\Local\Temp\ipykernel_16732\2831856154.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill')

       col1      col2      col3
A  0.329959  0.649713  0.755743
I  0.655309  0.817091  0.657176
C  0.655309  0.817091  0.657176
G  0.825311  0.193598  0.450150
E  0.825311  0.193598  0.450150
D  0.825311  0.193598  0.450150
F  0.825311  0.193598  0.450150
E  0.825311  0.193598  0.450150
H       NaN       NaN       NaN

In [37]:
df.fillna(method='ffill',axis=1)

C:\Users\asus\AppData\Local\Temp\ipykernel_16732\2272395643.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill',axis=1)

       col1      col2      col3
A  0.329959  0.649713  0.755743
I       NaN       NaN       NaN
C  0.655309  0.817091  0.657176
G       NaN       NaN       NaN
E  0.825311  0.193598  0.450150
D       NaN       NaN       NaN
F       NaN       NaN       NaN
E  0.825311  0.193598  0.450150
H       NaN       NaN       NaN

dropna()

In [38]:
df.dropna()  #temporary

       col1      col2      col3
A  0.329959  0.649713  0.755743
C  0.655309  0.817091  0.657176
E  0.825311  0.193598  0.450150
E  0.825311  0.193598  0.450150

In [41]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [A, I, C, G, E, D, F, E, H]

Replaceing the NaN value

In [43]:
df.replace({0.329959:100,0.649713:200})  #value is not match the given value
                                         # 0.329959 this is not exact value it have more number after the decimal 
                                         # 0.329959333444----------

       col1      col2      col3
A  0.329959  0.649713  0.755743
I       NaN       NaN       NaN
C  0.655309  0.817091  0.657176
G       NaN       NaN       NaN
E  0.825311  0.193598  0.450150
D       NaN       NaN       NaN
F       NaN       NaN       NaN
E  0.825311  0.193598  0.450150
H       NaN       NaN       NaN

In [48]:
df5=pd.DataFrame({"Apples":[50,95,106,75],"Grapes":[95,50,10,56],"Banana":[50,95,106,95]})

In [45]:
df

   Apples  Grapes
0      50      90
1      95      23
2     106      10
3      75      56

In [46]:
df.replace({50:90,10:200})

   Apples  Grapes
0      90      90
1      95      23
2     106     200
3      75      56

In [49]:
df5

   Apples  Grapes  Banana
0      50      95      50
1      95      50      95
2     106      10     106
3      75      56      95

In [50]:
df5.replace({50:99,95:276})

   Apples  Grapes  Banana
0      99     276      99
1     276      99     276
2     106      10     106
3      75      56     276

In [51]:
df

   Apples  Grapes
0      50      90
1      95      23
2     106      10
3      75      56

In [52]:
df.loc[2].Apples=99

In [53]:
df

   Apples  Grapes
0      50      90
1      95      23
2      99      10
3      75      56

In [54]:
df.loc[2]['Apples']=199

C:\Users\asus\AppData\Local\Temp\ipykernel_16732\1945304245.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df.loc[2]['Apples']=199

In [55]:
df

   Apples  Grapes
0      50      90
1      95      23
2     199      10
3      75      56

In [56]:
df.Apples.loc[0]=500

C:\Users\asus\AppData\Local\Temp\ipykernel_16732\2063831191.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df.Apples.loc[0]=500

In [57]:
df['Grapes'].loc[1]=299

C:\Users\asus\AppData\Local\Temp\ipykernel_16732\3573901887.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['Grapes'].loc[1]=299

In [58]:
df

   Apples  Grapes
0     500      90
1      95     299
2     199      10
3      75      56

Handle Duplicates Values

check the duplicate value-> duplicated()

In [59]:
df.duplicated()

0    False
1    False
2    False
3    False
dtype: bool

In [60]:
df5.duplicated()

0    False
1    False
2    False
3    False
dtype: bool

In [62]:
df5

   Apples  Grapes  Banana
0      50      95      50
1      95      50      95
2     106      10     106
3      75      56      95

In [64]:
df5.duplicated(subset=['Banana'])

0    False
1    False
2    False
3     True
dtype: bool

In [65]:
df.duplicated(subset=['Grapes'])

0    False
1    False
2    False
3    False
dtype: bool

remove duplicate value

In [66]:
df5.drop_duplicates(subset=['Banana'])

   Apples  Grapes  Banana
0      50      95      50
1      95      50      95
2     106      10     106

# import/export a dataset

In [80]:
data="https://www.contextures.com/xlsampledata01.html#:~:text=Excel%20Sample%20Data.%20This%20page%20has"

df=pd.read_html(data)

In [81]:
df

[                                                   0  \
 0  Home > Data > Sample > Sample Data Excel Sampl...
 1                                                NaN

                                                    1
 0                                                NaN
 1  This page has Microsoft Excel sample sales dat...  ,
     0                                                  1
 0 NaN  This page has Microsoft Excel sample sales dat...,
              0        1         2        3      4         5        6
 0    OrderDate   Region       Rep     Item  Units  UnitCost    Total
 1     1/6/2024     East     Jones   Pencil     95      1.99   189.05
 2    1/23/2024  Central    Kivell   Binder     50     19.99   999.50
 3     2/9/2024  Central   Jardine   Pencil     36      4.99   179.64
 4    2/26/2024  Central      Gill      Pen     27     19.99   539.73
 5    3/15/2024     West   Sorvino   Pencil     56      2.99   167.44
 6     4/1/2024     East     Jones   Binder     60      4.99   299.40
 7    4/18/2024  Central   Andrews   Pencil     75      1.99   149.25
 8     5/5/2024  Central   Jardine   Pencil     90      4.99   449.10
 9    5/22/2024     West  Thompson   Pencil     32      1.99    63.68
 10    6/8/2024     East     Jones   Binder     60      8.99   539.40
 11   6/25/2024  Central    Morgan   Pencil     90      4.99   449.10
 12   7/12/2024     East    Howard   Binder     29      1.99    57.71
 13   7/29/2024     East    Parent   Binder     81     19.99  1619.19
 14   8/15/2024     East     Jones   Pencil     35      4.99   174.65
 15    9/1/2024  Central     Smith     Desk      2    125.00   250.00
 16   9/18/2024     East     Jones  Pen Set     16     15.99   255.84
 17   10/5/2024  Central    Morgan   Binder     28      8.99   251.72
 18  10/22/2024     East     Jones      Pen     64      8.99   575.36
 19   11/8/2024     East    Parent      Pen     15     19.99   299.85
 20  11/25/2024  Central    Kivell  Pen Set     96      4.99   479.04
 21  12/12/2024  Central     Smith   Pencil     67      1.29    86.43
 22  12/29/2024     East    Parent  Pen Set     74     15.99  1183.26
 23   1/15/2025  Central      Gill   Binder     46      8.99   413.54
 24    2/1/2025  Central     Smith   Binder     87     15.00  1305.00
 25   2/18/2025     East     Jones   Binder      4      4.99    19.96
 26    3/7/2025     West   Sorvino   Binder      7     19.99   139.93
 27   3/24/2025  Central   Jardine  Pen Set     50      4.99   249.50
 28   4/10/2025  Central   Andrews   Pencil     66      1.99   131.34
 29   4/27/2025     East    Howard      Pen     96      4.99   479.04
 30   5/14/2025  Central      Gill   Pencil     53      1.29    68.37
 31   5/31/2025  Central      Gill   Binder     80      8.99   719.20
 32   6/17/2025  Central    Kivell     Desk      5    125.00   625.00
 33    7/4/2025     East     Jones  Pen Set     62      4.99   309.38
 34   7/21/2025  Central    Morgan  Pen Set     55     12.49   686.95
 35    8/7/2025  Central    Kivell  Pen Set     42     23.95  1005.90
 36   8/24/2025     West   Sorvino     Desk      3    275.00   825.00
 37   9/10/2025  Central      Gill   Pencil      7      1.29     9.03
 38   9/27/2025     West   Sorvino      Pen     76      1.99   151.24
 39  10/14/2025     West  Thompson   Binder     57     19.99  1139.43
 40  10/31/2025  Central   Andrews   Pencil     14      1.29    18.06
 41  11/17/2025  Central   Jardine   Binder     11      4.99    54.89
 42   12/4/2025  Central   Jardine   Binder     94     19.99  1879.06
 43  12/21/2025  Central   Andrews   Binder     28      4.99   139.72]

In [87]:
data="https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data"

df=pd.read_csv(data)

In [88]:
df

     5.1  3.5  1.4  0.2     Iris-setosa
0    4.9  3.0  1.4  0.2     Iris-setosa
1    4.7  3.2  1.3  0.2     Iris-setosa
2    4.6  3.1  1.5  0.2     Iris-setosa
3    5.0  3.6  1.4  0.2     Iris-setosa
4    5.4  3.9  1.7  0.4     Iris-setosa
..   ...  ...  ...  ...             ...
144  6.7  3.0  5.2  2.3  Iris-virginica
145  6.3  2.5  5.0  1.9  Iris-virginica
146  6.5  3.0  5.2  2.0  Iris-virginica
147  6.2  3.4  5.4  2.3  Iris-virginica
148  5.9  3.0  5.1  1.8  Iris-virginica

[149 rows x 5 columns]

In [96]:
df.to_html("newfileexcel.html",index=False)  #export

In [97]:
df.to_excel("newfileexcel.xlsx",index=False)  #export

In [92]:
df['1.4'].nunique()

43

In [93]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   5.1          149 non-null    float64
 1   3.5          149 non-null    float64
 2   1.4          149 non-null    float64
 3   0.2          149 non-null    float64
 4   Iris-setosa  149 non-null    object
dtypes: float64(4), object(1)
memory usage: 5.9+ KB

In [94]:
type(df)

pandas.core.frame.DataFrame